#### Terraform - Formatação e Estilo 🖌`success`
#### Terraform Init ⚙️`success`
#### Terraform Validação 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Detalhes do Terraform Plan</summary>

```terraform

data.aws_iam_role.lab_role: Reading...
aws_ecr_repository.repositorio_webhook: Refreshing state... [id=dev-tc-soat10-webhook]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01ee37ea8ac73dfe4]
aws_ecr_repository.repositorio_api: Refreshing state... [id=dev-tc-soat10-api]
data.aws_iam_role.lab_role: Read complete after 1s [id=LabRole]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d4e9d47cd99664e4]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0c82646a0664a56e5]
aws_security_group.cluster_ssh: Refreshing state... [id=sg-04865e2e2b8e44948]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0482ccaf3137c4fb0]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b404c73cfec21736]
aws_security_group.cluster_eks_port_80: Refreshing state... [id=sg-0d3d8429b94c60a2e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-062063af04c14b2f6]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09436ef569359ea74]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a6412e0b6a8ffb82]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0cfbd7985a3151cf3]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02cfd6f48ad96cb0d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08567fbb83d2254a2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a22a0090f4225da2]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02cfd6f48ad96cb0d1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f3bd8784076e37e9]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b6c0dc4c309b7f3d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f17ab6244cfe4263]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-020b7d80b81e6aca9]
aws_eks_cluster.eks_cluster: Refreshing state... [id=dev-tc-soat10-cluster-eks]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0263a9e66de89e8d3]
aws_eks_node_group.eks_node_group: Refreshing state... [id=dev-tc-soat10-cluster-eks:dev-tc-soat10-eks-node-group]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-08567fbb83d2254a21080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_ecr_repository.repositorio_api has been deleted
  - resource "aws_ecr_repository" "repositorio_api" {
        id                   = "dev-tc-soat10-api"
        name                 = "dev-tc-soat10-api"
      - repository_url       = "312011345107.dkr.ecr.us-east-1.amazonaws.com/dev-tc-soat10-api" -> null
        tags                 = {}
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository.repositorio_webhook has been deleted
  - resource "aws_ecr_repository" "repositorio_webhook" {
        id                   = "dev-tc-soat10-webhook"
        name                 = "dev-tc-soat10-webhook"
      - repository_url       = "312011345107.dkr.ecr.us-east-1.amazonaws.com/dev-tc-soat10-webhook" -> null
        tags                 = {}
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository.repositorio_api will be created
  + resource "aws_ecr_repository" "repositorio_api" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "tc-soat10-ecr-api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "environment" = "dev"
          + "terraform"   = "true"
        }
    }

  # aws_ecr_repository.repositorio_webhook will be created
  + resource "aws_ecr_repository" "repositorio_webhook" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "tc-soat10-ecr-webhook"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "environment" = "dev"
          + "terraform"   = "true"
        }
    }

  # aws_eks_cluster.eks_cluster must be replaced
-/+ resource "aws_eks_cluster" "eks_cluster" {
      ~ arn                           = "arn:aws:eks:us-east-1:312011345107:cluster/dev-tc-soat10-cluster-eks" -> (known after apply)
      ~ certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJV3RkMUNYeUJkdG93RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRBMU1qWXhNREU1TURCYUZ3MHpOVEExTWpReE1ESTBNREJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUMxN0hMTE5US3R6MU5ub2xyWEEyVUprdjVxVTZkTUhjdTZJWXBFSkFjVVhKMHJlNXhaZEQ2dHlGL3kKV2UrRVVFS0x1SUMxellwU0hWY2MwMU9JUU9Sd2JKWVVUY3JuZTRYSWtPZ0hpTFBDN0xJeDVmR3hCemxwaTJvUApzdFRyY0pKYm8yajVmUC9DWGxTSEtvQk5VbXdyNi9vbkxOVThhVmE4Smk2VzdoNnlyRkFWOFFrb3Y1a2VKYXVVCjVqQ2creFhRRWFJMVVnTk9pWXZTWTRUYXEwbGVaZ0FsUU92VnNvUDYwMDNTSG1rKzZEaVBhaXp5VlloL25XWmwKb0lZUE9SQU40WG1jczlhY3FJSjQ0N3YxcHRtY0xSaTFNUythdWdESllXUWRHTVFxQVI4ZDBpbU5seDBkVlNjZQpPM25RZWFwSkdYY2hhWlRlUTFxUUxvVm85Z1FIQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJST0lCRnFlblI0aHNWejR4UGd3NFA1M0xYbUlEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQ0NZVmpuUzlHWQpKcjk0UE84b3RLOW5VVXVYL3NLbVg0Sm1xY01mald4TGpwTm9jR1U5dWdBRndQejM3SFA5b01mb050WU5lekJZCmVocFlkc2tGREQydWhaZkpvZy9rWHo5Tm5mam1lT3hlM1lRM2xDNXcxNy96clNodE8xejZxWCttelp1Tm9pVU0KdTYycWJxR0JVU1dhaFRKL2NxbnhjaUVnR3VTSmdRaExVaXVoN25XUkRGemdNV1Uwc1lIckpTSC9SQWxrSHFCbApja1JrcC9qdklLT251c2FPclRwQ2REWGJDaEtidlk5bHBka1JNQnNaa0hlaWhEYjN2QjBoNGQvNmQ2ZGxNc1JyCkpiWS9UWmpubWVjR2pEWGxFakxwSVBmZFhpaWdwL3p1c2ZkYThSNG5zMHZEbHV4SDRkYlVadzJRQWhUVy8rVDUKV1A1VnQwbGVRYnFSCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      + cluster_id                    = (known after apply)
      ~ created_at                    = "2025-05-26T10:19:31Z" -> (known after apply)
      - enabled_cluster_log_types     = [] -> null
      ~ endpoint                      = "https://AB0842006D9EC71C8355A7F6857974B4.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
      ~ id                            = "dev-tc-soat10-cluster-eks" -> (known after apply)
      ~ identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/AB0842006D9EC71C8355A7F6857974B4"
                    },
                ]
            },
        ] -> (known after apply)
      ~ name                          = "dev-tc-soat10-cluster-eks" -> "tc-soat10-eks-cluster" # forces replacement
      ~ platform_version              = "eks.10" -> (known after apply)
      ~ status                        = "ACTIVE" -> (known after apply)
      - tags                          = {} -> null
      ~ version                       = "1.32" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ access_config (known after apply)
      - access_config {
          - authentication_mode                         = "CONFIG_MAP" -> null
          - bootstrap_cluster_creator_admin_permissions = true -> null
        }

      ~ kubernetes_network_config (known after apply)
      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null
            # (1 unchanged attribute hidden)

          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      ~ upgrade_policy (known after apply)
      - upgrade_policy {
          - support_type = "EXTENDED" -> null
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-0e904b6d5a89fccd5" -> (known after apply)
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> (known after apply)
          - security_group_ids        = [] -> null
          ~ vpc_id                    = "vpc-01ee37ea8ac73dfe4" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # aws_eks_node_group.eks_node_group must be replaced
-/+ resource "aws_eks_node_group" "eks_node_group" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:312011345107:nodegroup/dev-tc-soat10-cluster-eks/dev-tc-soat10-eks-node-group/c4cb8610-8512-6f8d-439c-947e01ce3630" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ cluster_name           = "dev-tc-soat10-cluster-eks" -> "tc-soat10-eks-cluster" # forces replacement
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "dev-tc-soat10-cluster-eks:dev-tc-soat10-eks-node-group" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "dev-tc-soat10-eks-node-group" -> "tc-soat10-eks-node-group" # forces replacement
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.32.3-20250519" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-dev-tc-soat10-eks-node-group-c4cb8610-8512-6f8d-439c-947e01ce3630"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "DELETING" -> (known after apply)
      - tags                   = {} -> null
      ~ version                = "1.32" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ node_repair_config (known after apply)

      ~ update_config (known after apply)
      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_security_group.cluster_eks_port_80 will be created
  + resource "aws_security_group" "cluster_eks_port_80" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Enable access from port 80"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "tc-soat10-eks-cluster-port-80-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "tc-soat10-eks-cluster-port-80-sg"
        }
      + tags_all               = {
          + "Name"        = "tc-soat10-eks-cluster-port-80-sg"
          + "environment" = "dev"
          + "terraform"   = "true"
        }
      + vpc_id                 = "vpc-01ee37ea8ac73dfe4"
    }

  # aws_security_group.cluster_ssh will be created
  + resource "aws_security_group" "cluster_ssh" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "tc-soat10-eks-cluster-ssh-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "tc-soat10-eks-cluster-ssh-sg"
        }
      + tags_all               = {
          + "Name"        = "tc-soat10-eks-cluster-ssh-sg"
          + "environment" = "dev"
          + "terraform"   = "true"
        }
      + vpc_id                 = "vpc-01ee37ea8ac73dfe4"
    }

Plan: 6 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ ecr_api     = "312011345107.dkr.ecr.us-east-1.amazonaws.com/dev-tc-soat10-api" -> (known after apply)
  ~ ecr_webhook = "312011345107.dkr.ecr.us-east-1.amazonaws.com/dev-tc-soat10-webhook" -> (known after apply)
  ~ eks_endoint = "https://AB0842006D9EC71C8355A7F6857974B4.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Enviado por: @ronanluiz, Action: `pull_request`*